#include <stdio.h>
#include <string.h>
#include <ctype.h>

/* 
 * 2번째 페이지로, 앞 페이지와 누적된 유형 분류 횟수가 기록된다
 *
 * c언어로 된 문제를 분석하고 푸는 장소.
 * 문제 유형별로 정리를 해보자.
 * 
 * 용어/개념 물어보기(서술형): 1회
 * 정렬 알고리즘 => 기본: 1회, do_while 문: 1회
 * 단순 => 계산형: 6회, 재귀형: 3회, 추론형: 1회, 구조체: 1회, case 문: 1회
 * 복잡 => 배열: 1회, 증감 연산자: 1회, 수학적: 1회, 구조체&포인터&연산: 1회
 * 포인터 => 문자열: 5회, 구조체: 2회, 배열: 2회, 구조체&화살표: 2회, 아스키코드: 1회
 * 이중 포인터 => 배열: 1회, 2차원 배열: 1회
 * 기타 => 삼항&비트연산: 1회
 * 
 * 추론형..이란 역순, 소수 등 여러 수와 관련된 계산을 의미한다
 */



/** 이중 포인터 문제.. **/
int main(){
    // 2차원 배열, 이중 포인터 사용이 가능하다
    int arr[3][3] ={1, 2, 3, 4, 5, 6, 7, 8, 9};
    // 1차원 포인터 배열, 두 개의 주소값을 가질 수 있어며 2열 시작주소, 3열 시작 주소를 값으로 가지고 있다
    int *parr[2]={arr[1], arr[2]};

    // parr => 배열 시작주소, parr[1] => arr[2]의 주소, parr[1][2] => arr[2][2]의 값: 8
    // parr[1] => arr[2] . arr[2]라는 주소값. 여기에 +=2하면, arr[2][2] 주소값이 됨. 역참조 시: 9
    // .. **parr는 일단 parr[0][0]의 값이다 => 4

    // 8 + 9 + 4 = 21
    printf("%d", parr[1][2] + *(parr[1] + 2)+ **parr);
    return 0;
}